In [1]:
import pandas as pd

In [2]:
pprint

Pretty printing has been turned OFF

In [4]:
dir(pd)

['ArrowDtype', 'BooleanDtype', 'Categorical', 'CategoricalDtype', 'CategoricalIndex', 'DataFrame', 'DateOffset', 'DatetimeIndex', 'DatetimeTZDtype', 'ExcelFile', 'ExcelWriter', 'Flags', 'Float32Dtype', 'Float64Dtype', 'Grouper', 'HDFStore', 'Index', 'IndexSlice', 'Int16Dtype', 'Int32Dtype', 'Int64Dtype', 'Int8Dtype', 'Interval', 'IntervalDtype', 'IntervalIndex', 'MultiIndex', 'NA', 'NaT', 'NamedAgg', 'Period', 'PeriodDtype', 'PeriodIndex', 'RangeIndex', 'Series', 'SparseDtype', 'StringDtype', 'Timedelta', 'TimedeltaIndex', 'Timestamp', 'UInt16Dtype', 'UInt32Dtype', 'UInt64Dtype', 'UInt8Dtype', '__all__', '__builtins__', '__cached__', '__doc__', '__docformat__', '__file__', '__git_version__', '__loader__', '__name__', '__package__', '__path__', '__spec__', '__version__', '_config', '_is_numpy_dev', '_libs', '_testing', '_typing', '_version', 'annotations', 'api', 'array', 'arrays', 'bdate_range', 'compat', 'concat', 'core', 'crosstab', 'cut', 'date_range', 'describe_option', 'errors', 'eval', 'factorize', 'from_dummies', 'get_dummies', 'get_option', 'infer_freq', 'interval_range', 'io', 'isna', 'isnull', 'json_normalize', 'lreshape', 'melt', 'merge', 'merge_asof', 'merge_ordered', 'notna', 'notnull', 'offsets', 'option_context', 'options', 'pandas', 'period_range', 'pivot', 'pivot_table', 'plotting', 'qcut', 'read_clipboard', 'read_csv', 'read_excel', 'read_feather', 'read_fwf', 'read_gbq', 'read_hdf', 'read_html', 'read_json', 'read_orc', 'read_parquet', 'read_pickle', 'read_sas', 'read_spss', 'read_sql', 'read_sql_query', 'read_sql_table', 'read_stata', 'read_table', 'read_xml', 'reset_option', 'set_eng_float_format', 'set_option', 'show_versions', 'test', 'testing', 'timedelta_range', 'to_datetime', 'to_numeric', 'to_pickle', 'to_timedelta', 'tseries', 'unique', 'util', 'value_counts', 'wide_to_long']

In [5]:
len(dir(pd))

138

In [6]:
type(pd)

In [7]:
df1=pd.DataFrame({"A","B","C","D"})
df1

#dataframe 2D/3D

   0
0  C
1  B
2  A
3  D

In [9]:
sr1=pd.Series([100,200,300,400,500,600,700,800])
sr1

#series 1D data

0    100
1    200
2    300
3    400
4    500
5    600
6    700
7    800
dtype: int64

In [11]:
#indexing on series

sr1[0]

100

In [12]:
#slicing on series

sr1[:]

0    100
1    200
2    300
3    400
4    500
5    600
6    700
7    800
dtype: int64

In [13]:
sr1[2:5]

2    300
3    400
4    500
dtype: int64

In [14]:
df2=pd.DataFrame(
    {
       'col1':[1,2,3,4,5],
        'col2':[10,20,30,40,40],
        'col3':[100,200,300,400,500] 
    }
)
df2

   col1  col2  col3
0     1    10   100
1     2    20   200
2     3    30   300
3     4    40   400
4     5    40   500

In [15]:
df3=pd.DataFrame(
    {
        'emp_no':[1,2,3,4,5,6,7,8],
        'emp_name':['ravi','kiran','srilu','sanjana','neha','bhavana','basu','subbu'],
        'job':['Developer','Tester','DevOps','Frontend','Backend','Fullstack','Tester','Tester']
    }
    
)

df3

   emp_no emp_name        job
0       1     ravi  Developer
1       2    kiran     Tester
2       3    srilu     DevOps
3       4  sanjana   Frontend
4       5     neha    Backend
5       6  bhavana  Fullstack
6       7     basu     Tester
7       8    subbu     Tester

In [16]:
df3['emp_no']

0    1
1    2
2    3
3    4
4    5
5    6
6    7
7    8
Name: emp_no, dtype: int64

In [17]:
df3['emp_name']

0       ravi
1      kiran
2      srilu
3    sanjana
4       neha
5    bhavana
6       basu
7      subbu
Name: emp_name, dtype: object

In [18]:
df3['emp_name'][3]

'sanjana'

In [19]:
df3['emp_name'][2:5]

2      srilu
3    sanjana
4       neha
Name: emp_name, dtype: object

In [20]:
df3.head()

   emp_no emp_name        job
0       1     ravi  Developer
1       2    kiran     Tester
2       3    srilu     DevOps
3       4  sanjana   Frontend
4       5     neha    Backend

In [21]:
df3.tail()

   emp_no emp_name        job
3       4  sanjana   Frontend
4       5     neha    Backend
5       6  bhavana  Fullstack
6       7     basu     Tester
7       8    subbu     Tester

In [22]:
df3.tail(2)

   emp_no emp_name     job
6       7     basu  Tester
7       8    subbu  Tester

In [23]:
employee_names=df3['emp_name']
employee_names

0       ravi
1      kiran
2      srilu
3    sanjana
4       neha
5    bhavana
6       basu
7      subbu
Name: emp_name, dtype: object

In [24]:
type(employee_names)